<html>
<!-- date de creation: 30/03/2001 -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title></title>
<meta name="Description" content="">
<meta name="Keywords" content="">
<meta name="Author" content="Usager non enregistr&eacute;">
<meta name="Generator" content="WebExpert 2000">
</head>
<body>

Dans les cultures c&eacute;r&eacute;ali&egrave;res, des &eacute;tudes th&eacute;oriques et exp&eacute;rimentales ont montr&eacute; que l'utilisation de m&eacute;langes de vari&eacute;t&eacute;s 
susceptibles et de vari&eacute;t&eacute;s r&eacute;sistantes &agrave; un m&ecirc;me champignon pathog&egrave;ne entra&icirc;ne une forte diminution du d&eacute;veloppement de 
l'&eacute;pid&eacute;mie. L'explication est un simple effet de dilution, une partie des spores produites sur les vari&eacute;t&eacute;s susceptibles &eacute;tant 
perdue par d&eacute;p&ocirc;t sur les vari&eacute;t&eacute;s r&eacute;sistantes. Si deux pathotypes A et B d'un m&ecirc;me champignon pathog&egrave;ne sont pr&eacute;sents, au ph&eacute;nom&egrave;ne 
de dilution s'ajoute un ph&eacute;nom&egrave;ne dit de r&eacute;sistance induite : une partie des spores produites sur une vari&eacute;t&eacute; susceptible &agrave; A tombant 
sur une vari&eacute;t&eacute; r&eacute;sistante &agrave; A mais susceptible &agrave; B d&eacute;clenche une r&eacute;sistance (locale, partielle, temporaire) &agrave; B. D'autres &eacute;tudes 
sugg&egrave;rent qu'une telle population m&eacute;lang&eacute;e va tr&egrave;s rapidement conduire &agrave; la s&eacute;lection d'un "super" pathotype virulent vis-&agrave;-vis de 
la plupart des r&eacute;sistances en pr&eacute;sence. La dynamique d'un pathosyst&egrave;me compos&eacute; de plusieurs vari&eacute;t&eacute;s et de plusieurs pathotypes est 
le r&eacute;sultat d'interactions complexes entre les r&eacute;sistances des vari&eacute;t&eacute;s, les virulences des pathotypes, et la s&eacute;lection de "super" 
pathotypes. Les mod&egrave;les sont de bons outils pour permettre d'appr&eacute;hender une telle complexit&eacute;.<br><br>

Une &eacute;tude bibliographique a mis en avant une grande vari&eacute;t&eacute; d'approches de la mod&eacute;lisation de la dynamique spatiotemporelle 
des &eacute;pid&eacute;mies : mod&egrave;les analytiques, mod&egrave;les de diffusion, mod&egrave;les stochastiques, mod&egrave;les m&eacute;canistes. L'hypoth&egrave;se de base des mod&egrave;les 
analytiques est que les spores produites et lib&eacute;r&eacute;es se red&eacute;posent uniform&eacute;ment sur l'espace mod&eacute;lis&eacute;. L'apport principal de ces mod&egrave;les 
a &eacute;t&eacute; de montrer th&eacute;oriquement que la s&eacute;lection qui s'op&egrave;re au cours du d&eacute;veloppement de l'&eacute;pid&eacute;mie dans des m&eacute;langes rend peu probable 
la coexistence de plusieurs pathotypes, mais que ce n'est pas n&eacute;cessairement un "super" pathotype qui est s&eacute;lectionn&eacute;. Les mod&egrave;les de 
diffusion ont pour base th&eacute;orique la physique des ph&eacute;nom&egrave;nes de diffusion et sont bas&eacute;es sur une ou plusieurs &eacute;quations aux d&eacute;riv&eacute;es 
partielles espace - temps. L'utilisation de ces mod&egrave;les est soumise &agrave; certaines conditions d'applicabilit&eacute; de la th&eacute;orie. Ils r&eacute;sultent 
en une &eacute;pid&eacute;mie qui se propage dans l'espace au cours du temps &agrave; la mani&egrave;re d'une vague dont le front avance &agrave; vitesse constante. Dans 
les mod&egrave;les stochastiques, des fonctions de r&eacute;partition d'une variable al&eacute;atoire sont utilis&eacute;es pour simuler la production et la 
dispersion des spores. Cela introduit un peu d'al&eacute;as dans la dynamique mod&eacute;lis&eacute;e, ce qui la rend plus "naturelle", et une grande 
vari&eacute;t&eacute; de motifs spatiaux peut &ecirc;tre g&eacute;n&eacute;r&eacute;e par l'utilisation de diff&eacute;rentes fonctions. Des mod&egrave;les stochastiques bas&eacute;s sur une 
approche r&eacute;seau d'automates cellulaires ont aussi &eacute;t&eacute; d&eacute;velopp&eacute;s. Dans les mod&egrave;les m&eacute;canistes, les param&egrave;tres &eacute;pid&eacute;miologiques 
(taux de croissance de l'&eacute;pid&eacute;mie, p&eacute;riode de latence, p&eacute;riode infectieuse) sont reli&eacute;s aux variables environnementales (temp&eacute;rature, 
humidit&eacute;) et un mod&egrave;le du d&eacute;veloppement ph&eacute;nologique et de la croissance foliaire de la plante h&ocirc;te est introduit.

</body>
</html>
