<html>
<!-- date de creation: 30/03/2001 -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title></title>
<meta name="Description" content="">
<meta name="Keywords" content="">
<meta name="Author" content="Usager non enregistr&eacute;">
<meta name="Generator" content="WebExpert 2000">
</head>
<body>

<i><font size="+1">Choix du mod&egrave;le : mod&egrave;le agr&eacute;g&eacute; vs. mod&egrave;le individuel</font></i><br><br>

Les premiers efforts de mod&eacute;lisation en dynamique des populations se sont concentr&eacute;s vers des mod&egrave;les o&ugrave; l'on manipule une variable 
agr&eacute;g&eacute;e caract&eacute;ristique de la population consid&eacute;r&eacute;e dans son ensemble, par exemple la densit&eacute;. Ces mod&egrave;les sont appel&eacute;s mod&egrave;les 
agr&eacute;g&eacute;s de dynamique des populations. Ils s'appuient sur une &eacute;quation diff&eacute;rentielle ou sur plusieurs &eacute;quations diff&eacute;rentielles 
coupl&eacute;es (mod&egrave;le logistique, mod&egrave;le de Lotka-Volterra), ou sur une matrice de transition (mod&egrave;le markovien). Diff&eacute;rentes classes 
d'&acirc;ge au sein d'une m&ecirc;me population sont consid&eacute;r&eacute;es dans les mod&egrave;les matriciels de Leslie. L'espace est parfois introduit dans 
ces mod&egrave;les, soit sous forme continue comme dans les mod&egrave;les de r&eacute;action-diffusion, o&ugrave; les populations diffusent dans l'espace, 
soit sous forme discr&egrave;te comme dans les mod&egrave;les logistiques multisites, ou les matrices de Leslie multisites, o&ugrave; les ph&eacute;nom&egrave;nes 
d'&eacute;migration et d'immigration entre les populations de diff&eacute;rents sites sont consid&eacute;r&eacute;s.<br><br>

Les mod&egrave;les agr&eacute;g&eacute;s n'ont pas qu'un int&eacute;r&ecirc;t historique et m&eacute;ritent une analyse plus d&eacute;taill&eacute;e qu'une simple revue bibliographique. 
Ils sont suffisamment g&eacute;n&eacute;raux pour s'appliquer en premi&egrave;re approximation &agrave; de nombreuses situations. Ils ont aussi l'avantage de 
pouvoir &ecirc;tre &eacute;tudi&eacute;s analytiquement et de b&eacute;n&eacute;ficier d'une solide base th&eacute;orique en calcul diff&eacute;rentiel ou en calcul matriciel. 
Enfin, de tels mod&egrave;les pr&eacute;sentent des comportements plus complexes que ne le laisse supposer la simplicit&eacute; de la mod&eacute;lisation, 
en particulier des comportements chaotiques et des dynamiques transitoires. En conclusion, ce sont d'excellents outils p&eacute;dagogiques 
parce qu'ils permettent d'illustrer de nombreux types d'interactions et de dynamiques diff&eacute;rentes &agrave; partir de tr&egrave;s peu d'&eacute;quations 
et de param&egrave;tres. Mais ces mod&egrave;les ont aussi leurs limites. Ils utilisent des param&egrave;tres difficilement mesurables. Ils ne permettent 
pas facilement d'&eacute;tudier des ph&eacute;nom&egrave;nes spatiaux. Ils ne permettent pas non plus d'aborder les ph&eacute;nom&egrave;nes d'&eacute;mergence de propri&eacute;t&eacute;s 
au niveau de la population &agrave; partir des interactions locales entre les individus, contrairement aux mod&egrave;les individuels de dynamique 
des populations.<br><br>

Les mod&egrave;les individuels de dynamique des populations, et en particulier les mod&egrave;les par trou&eacute;e dans le cadre de la simulation de 
la dynamique foresti&egrave;re, sont des mod&egrave;les m&eacute;canistes issue d'une approche ressource-r&eacute;ponse : les objets de comp&eacute;tition (les ressources) 
et un m&eacute;canisme (l'utilisation de ces ressources par les individus, la r&eacute;ponse des organismes &agrave; ces ressources) y sont explicitement 
mod&eacute;lis&eacute;s. Les mod&egrave;les par trou&eacute;e sont plus connus sous leur nom anglo-saxon de "gap models" ou encore sous la classification de mod&egrave;les 
type JABOWA-FORET, du nom des deux premiers mod&egrave;les par trou&eacute;e d&eacute;velopp&eacute;s au cours des ann&eacute;es 70. Il s'agit de mod&egrave;les o&ugrave; l'individu est 
l'entit&eacute; &eacute;l&eacute;mentaire manipul&eacute;e. Ils sont non spatialis&eacute;s puisqu'ils mod&eacute;lisent la dynamique d'une parcelle foresti&egrave;re de petite taille 
o&ugrave; chaque individu interagit avec tous les autres. Un individu poss&egrave;de un certain nombre d'attributs (esp&egrave;ce, diam&egrave;tre &agrave; hauteur de 
poitrine, hauteur, surface foliaire) qui sont utilis&eacute;s pour d&eacute;terminer la comp&eacute;tition entre les individus de la parcelle pour les 
ressources du milieu (lumi&egrave;re, eau, &eacute;l&eacute;ments nutritifs, espace). La dynamique mod&eacute;lis&eacute;e est bas&eacute;e sur les processus de naissance, de 
croissance, de comp&eacute;tition et de mortalit&eacute; des individus.<br><br>

Ces mod&egrave;les ont donc, d&egrave;s le d&eacute;part, une base &eacute;cophysiologique, d&eacute;mographique et communautaire, et conduisent &agrave; une formidable 
synth&egrave;se de connaissances pr&eacute;alablement diss&eacute;min&eacute;es au sein de diff&eacute;rentes disciplines. Une telle synth&egrave;se n&eacute;cessite de choisir 
les ph&eacute;nom&egrave;nes &agrave; consid&eacute;rer, puis de les simplifier, choix et simplifications &eacute;tant justifi&eacute;s a posteriori au regard de la confrontation 
des r&eacute;sultats du mod&egrave;le &agrave; la r&eacute;alit&eacute;. Les mod&egrave;les constituent alors de v&eacute;ritables outils de recherche. Une fois param&eacute;tr&eacute;s, les mod&egrave;les 
par trou&eacute;e sont tr&egrave;s bien adapt&eacute;s &agrave; la pr&eacute;vision de la dynamique de la composition floristique d'&eacute;cosyst&egrave;mes forestiers dans des 
conditions tr&egrave;s diverses de lumi&egrave;re, de temp&eacute;rature, d'humidit&eacute;, et de fertilit&eacute;. Cette dynamique &eacute;merge des interactions entre les 
diff&eacute;rents individus mod&eacute;lis&eacute;s. Les mod&egrave;les par trou&eacute;e ont aussi leurs limites. D'abord parce qu'il en existe beaucoup et qu'ils sont 
difficilement comparables : les premiers mod&egrave;les par trou&eacute;e ont pos&eacute; les grands principes qui ont &eacute;t&eacute; repris ensuite par une multitude 
de mod&egrave;les avec chacun leurs petites sp&eacute;cificit&eacute;s. Ensuite parce qu'ils restent difficiles &agrave; param&eacute;trer, surtout s'il y a peu de donn&eacute;es 
de terrain sur le syst&egrave;me particulier &eacute;tudi&eacute;. Certains param&egrave;tres simplificateurs sont aussi tr&egrave;s th&eacute;oriques, sans doute non mesurables, 
et requi&egrave;rent une estimation au bon sens. Enfin, les mod&egrave;les par trou&eacute;e sont &agrave; la base non spatialis&eacute;s donc inutilisables pour 
consid&eacute;rer des ph&eacute;nom&egrave;nes qui se propagent dans l'espace comme les chablis, les feux, ou les maladies.<br><br>

<i><font size="+1">Deux approches conceptuelles pour la spatialisation : approche orient&eacute;e espace vs. approche orient&eacute;e individu</font></i><br><br>

Deux approches conceptuelles diff&eacute;rentes de spatialisation d'un mod&egrave;le par trou&eacute;e sont possibles. La premi&egrave;re est une approche orient&eacute;e 
espace qui consiste &agrave; discr&eacute;tiser l'espace forestier en cellules r&eacute;guli&egrave;res et &agrave; faire une association du type une cellule / un arbre. 
Chaque arbre est influenc&eacute; par les arbres pr&eacute;sents dans son voisinage. Le voisinage d'un arbre est explicite puisqu'il s'agit simplement 
des arbres pr&eacute;sents dans les cellules voisines. A chaque pas de temps, on balaye l'ensemble des cellules comme on balaye les &eacute;l&eacute;ments 
d'une matrice. L'&eacute;tat de chaque cellule au pas de temps   d&eacute;pend de l'&eacute;tat des cellules dans son voisinage au pas de temps t et l'on a 
un syst&egrave;me de type r&eacute;seau d'automates cellulaires. La seconde est une approche orient&eacute;e individu qui consiste &agrave; donner aux arbres des 
coordonn&eacute;es spatiales au sein de l'espace forestier. On a alors une liste d'individus localis&eacute;s. Pour chaque individu, on doit rechercher 
parmi cette liste quels sont les individus pr&eacute;sents dans son voisinage par un calcul de distance. A chaque pas de temps, on balaye 
l'ensemble des individus et l'on a un syst&egrave;me de type mod&egrave;le centr&eacute; individu spatialis&eacute;.<br><br>

Puisque aucune des approches n'a sembl&eacute; meilleure que l'autre a priori, les deux ont &eacute;t&eacute; mises en œuvre au cours de la th&egrave;se et cela 
a conduit &agrave; deux mod&egrave;les spatialis&eacute;s l&eacute;g&egrave;rement diff&eacute;rents dont les r&eacute;sultats de simulation ont &eacute;t&eacute; compar&eacute;s en analysant les &eacute;volutions 
temporelles des surfaces terri&egrave;res sp&eacute;cifiques et les distributions spatiales des individus. Les deux mod&egrave;les conduisent &agrave; des r&eacute;sultats diff&eacute;rents, mais leur comparaison a permis d'&eacute;valuer les cons&eacute;quences de petites diff&eacute;rences conceptuelles dans la proc&eacute;dure de r&eacute;g&eacute;n&eacute;ration d'un mod&egrave;le &agrave; l'autre. Nous pouvons ainsi conclure que cette proc&eacute;dure est tr&egrave;s sensible. C'est aussi malheureusement celle qui suscite le moins d'unanimit&eacute; dans les d&eacute;marches adopt&eacute;es dans les mod&egrave;les. Les deux mod&egrave;les peuvent chacun &ecirc;tre d&eacute;velopp&eacute;s dans une perspective diff&eacute;rente, la forme matricielle du r&eacute;seau d'automates cellulaires permettant un couplage facile avec un Syst&egrave;me d'Informations G&eacute;ographiques, l'architecture centr&eacute;e individu du second le rendant proche d'un Syst&egrave;me Multi Agents. L'int&eacute;r&ecirc;t de la spatialisation, outre la production de cartographies permettant l'&eacute;tude de la distribution spatiale des individus, permet d'envisager la mod&eacute;lisation de ph&eacute;nom&egrave;nes se propageant dans l'espace comme les chablis. La param&eacute;trisation de ces mod&egrave;les, comme pour les mod&egrave;les par trou&eacute;e, reste cependant difficile. L'introduction du relief, d'un mod&egrave;le de calcul du rayonnement solaire et d'un mod&egrave;le de calcul des bilans hydrique - hydrologique spatialis&eacute;s tenant compte de ce relief, rend possible la spatialisation de plusieurs param&egrave;tres importants des mod&egrave;les par trou&eacute;e : le rayonnement solaire incident au-dessus de la canop&eacute;e, la temp&eacute;rature, les pr&eacute;cipitations, la r&eacute;serve utile du sol et la distance au toit de la nappe phr&eacute;atique. Cela constitue une extension des mod&egrave;les par trou&eacute;e vers des mod&egrave;les de simulation de la dynamique foresti&egrave;re &agrave; l'&eacute;chelle du paysage. Les potentialit&eacute;s de ce genre de mod&egrave;les pour &eacute;tudier les facteurs favorisant le maintien de la richesse sp&eacute;cifique sont tr&egrave;s grandes parce que l'introduction du relief rend l'espace mod&eacute;lis&eacute; h&eacute;t&eacute;rog&egrave;ne et entra&icirc;ne une grande diversit&eacute; de 
conditions environnementales auxquelles les diff&eacute;rentes esp&egrave;ces seront plus ou moins bien adapt&eacute;es. Un tel mod&egrave;le pose &eacute;videmment 
des probl&egrave;mes de param&eacute;trisation et de validation toujours plus grands, voire insolubles, sauf dans le cadre de l'&eacute;tude d'un site 
particulier pour lequel de nombreuses donn&eacute;es seraient disponibles. Le comportement hydrologique d'un bassin versant, par exemple, 
d&eacute;pend de facteurs g&eacute;ologiques, climatologiques, m&eacute;caniques ou hydrologiques qui peuvent &ecirc;tre diff&eacute;rents m&ecirc;me pour deux bassins ayant 
le m&ecirc;me relief, ce qui ne facilite pas la g&eacute;n&eacute;ralisation des r&eacute;sultats.<br><br>

<i><font size="+1">Sensibilit&eacute; et validation des mod&egrave;les</font></i><br><br>

L'&eacute;tude de la sensibilit&eacute; des mod&egrave;les logistiques et des mod&egrave;les markoviens aux conditions initiales et aux valeurs des param&egrave;tres 
a permis de mettre en &eacute;vidence une vari&eacute;t&eacute; de comportements qui contraste avec la simplicit&eacute; des mod&egrave;les. La possibilit&eacute; d'&eacute;tudier 
ces mod&egrave;les de mani&egrave;re analytique est clairement un atout. A l'oppos&eacute;, les mod&egrave;les par trou&eacute;e spatialis&eacute;s ne peuvent &ecirc;tre &eacute;tudi&eacute;s 
que par simulation, et les conclusions sur la sensibilit&eacute; aux conditions initiales, aux valeurs des param&egrave;tres et aux conditions 
aux limites sont plus difficiles &agrave; d&eacute;gager. Seuls l'exp&eacute;rience d'utilisation de ces syst&egrave;mes et quelques tests en conditions normales 
d'utilisation permettent de supposer que les mod&egrave;les sont peu sensibles aux conditions initiales et mod&eacute;r&eacute;ment sensibles aux valeurs 
des param&egrave;tres. Le choix des conditions aux limites de type recouvrement torique, le bord droit de l'espace mod&eacute;lis&eacute; &eacute;tant reli&eacute;e au 
bord gauche et le bord bas au bord haut, conduit &agrave; un syst&egrave;me ergodique. De cette propri&eacute;t&eacute; d&eacute;coule qu'il y a &eacute;quivalence, dans une 
certaine mesure qui d&eacute;pend du temps caract&eacute;ristique des processus &agrave; l'œuvre, entre dynamique temporelle &agrave; &eacute;chelle locale et distribution 
spatiale &agrave; &eacute;chelle globale. Cette propri&eacute;t&eacute; est importante dans une perspective de validation. C'est en effet l'&eacute;chelle temporelle des 
simulations (plusieurs centaines d'ann&eacute;es) qui rend difficile, mais non impossible, l'existence de donn&eacute;es de validation. La distribution 
spatiale simul&eacute;e peut, elle, &ecirc;tre plus facilement compar&eacute;e &agrave; une cartographie existante. Je me suis efforc&eacute; de d&eacute;gager quelques 
pr&eacute;somptions g&eacute;n&eacute;rales de validation, guid&eacute; par l'analyse de propri&eacute;t&eacute;s globales du peuplement &eacute;mergeant des interactions locales entre 
les individus. Les tests de validation envisag&eacute;s, succession &eacute;cologique, distribution des classes diam&eacute;triques, relations d'auto-&eacute;claircie, 
dynamique spatio-temporelle au niveau de l'&eacute;co-unit&eacute;, distribution spatiale des individus regroup&eacute;s en trois strates, sont encourageants.<br><br>

L'ensemble de ce travail est essentiellement de nature th&eacute;orique, mais plusieurs missions d'&eacute;tude en for&ecirc;t dans la R&eacute;serve Naturelle Mummelskopf, 
Rheinland-Pfalz, Allemagne (h&ecirc;traie - ch&ecirc;naie), la R&eacute;serve de l'homme et de la biosph&egrave;re de la vall&eacute;e du Fango, Corse (ch&ecirc;naie &agrave; maquis), 
et la R&eacute;serve Naturelle de Duchesnay, Sainte Catherine de la Jacques Cartier, Qu&eacute;bec, Canada (&eacute;rabli&egrave;re - h&ecirc;traie &agrave; bouleaux jaunes), 
m'ont permis d'appr&eacute;hender la r&eacute;alit&eacute; de la dynamique foresti&egrave;re.


</body>
</html>
